tirish/Wave-Generator/src/stm32f4xx_DMA_registers01.inc
@;stm32f4xx_DMA_registers01.inc wmh 2013-11-27 : absolute and relative DMA register addresses 
@; derived from ST RM0090 reference manual DM00031020.pdf pages 53,243-246

@;DMA register group base addresses
.equ DMA1_base     	,0x40026000
.equ DMA2_base     	,0x40026400

@;DMA register offsets
.equ relDMA_LISR 	,0x0000
.equ relDMA_HISR	,0x0004 
.equ relDMA_LIFCR	,0x0008 
.equ relDMA_HIFCR	,0x000C 
.equ relDMA_S0CR	,0x0010 
.equ relDMA_S0NDTR	,0x0014 
.equ relDMA_S0PAR	,0x0018 
.equ relDMA_S0M0AR	,0x001C 
.equ relDMA_S0M1AR	,0x0020 
.equ relDMA_S0FCR	,0x0024 
.equ relDMA_S1CR	,0x0028 
.equ relDMA_S1NDTR	,0x002C 
.equ relDMA_S1PAR	,0x0030 
.equ relDMA_S1M0AR	,0x0034 
.equ relDMA_S1M1AR	,0x0038 
.equ relDMA_S1FCR	,0x003C 
.equ relDMA_S2CR	,0x0040 
.equ relDMA_S2NDTR	,0x0044 
.equ relDMA_S2PAR	,0x0048 
.equ relDMA_S2M0AR	,0x004C 
.equ relDMA_S2M1AR	,0x0050 
.equ relDMA_S2FCR	,0x0054 
.equ relDMA_S3CR	,0x0058 
.equ relDMA_S3NDTR	,0x005C 
.equ relDMA_S3PAR	,0x0060 
.equ relDMA_S3M0AR	,0x0064 
.equ relDMA_S3M1AR	,0x0068 
.equ relDMA_S3FCR	,0x006C 
.equ relDMA_S4CR	,0x0070 
.equ relDMA_S4NDTR	,0x0074 
.equ relDMA_S4PAR	,0x0078 
.equ relDMA_S4M0AR	,0x007C 
.equ relDMA_S4M1AR	,0x0080 
.equ relDMA_S4FCR	,0x0084 
.equ relDMA_S5CR	,0x0088 
.equ relDMA_S5NDTR	,0x008C 
.equ relDMA_S5PAR	,0x0090 
.equ relDMA_S5M0AR	,0x0094 
.equ relDMA_S5M1AR	,0x0098 
.equ relDMA_S5FCR	,0x009C 
.equ relDMA_S6CR	,0x00A0 
.equ relDMA_S6NDTR	,0x00A4 
.equ relDMA_S6PAR	,0x00A8 
.equ relDMA_S6M0AR	,0x00AC 
.equ relDMA_S6M1AR	,0x00B0 
.equ relDMA_S6FCR	,0x00B4 
.equ relDMA_S7CR	,0x00B8 
.equ relDMA_S7NDTR	,0x00BC 
.equ relDMA_S7PAR	,0x00C0 
.equ relDMA_S7M0AR	,0x00C4 
.equ relDMA_S7M1AR	,0x00C8 
.equ relDMA_S7FCR	,0x00CC 

@; DMA1 absolute register addresses
.equ absDMA1_LISR 	,DMA1_base+0x0000
.equ absDMA1_HISR	,DMA1_base+0x0004 
.equ absDMA1_LIFCR	,DMA1_base+0x0008 
.equ absDMA1_HIFCR	,DMA1_base+0x000C 
.equ absDMA1_S0CR	,DMA1_base+0x0010 
.equ absDMA1_S0NDTR	,DMA1_base+0x0014 
.equ absDMA1_S0PAR	,DMA1_base+0x0018 
.equ absDMA1_S0M0AR	,DMA1_base+0x001C 
.equ absDMA1_S0M1AR	,DMA1_base+0x0020 
.equ absDMA1_S0FCR	,DMA1_base+0x0024 
.equ absDMA1_S1CR	,DMA1_base+0x0028 
.equ absDMA1_S1NDTR	,DMA1_base+0x002C 
.equ absDMA1_S1PAR	,DMA1_base+0x0030 
.equ absDMA1_S1M0AR	,DMA1_base+0x0034 
.equ absDMA1_S1M1AR	,DMA1_base+0x0038 
.equ absDMA1_S1FCR	,DMA1_base+0x003C 
.equ absDMA1_S2CR	,DMA1_base+0x0040 
.equ absDMA1_S2NDTR	,DMA1_base+0x0044 
.equ absDMA1_S2PAR	,DMA1_base+0x0048 
.equ absDMA1_S2M0AR	,DMA1_base+0x004C 
.equ absDMA1_S2M1AR	,DMA1_base+0x0050 
.equ absDMA1_S2FCR	,DMA1_base+0x0054 
.equ absDMA1_S3CR	,DMA1_base+0x0058 
.equ absDMA1_S3NDTR	,DMA1_base+0x005C 
.equ absDMA1_S3PAR	,DMA1_base+0x0060 
.equ absDMA1_S3M0AR	,DMA1_base+0x0064 
.equ absDMA1_S3M1AR	,DMA1_base+0x0068 
.equ absDMA1_S3FCR	,DMA1_base+0x006C 
.equ absDMA1_S4CR	,DMA1_base+0x0070 
.equ absDMA1_S4NDTR	,DMA1_base+0x0074 
.equ absDMA1_S4PAR	,DMA1_base+0x0078 
.equ absDMA1_S4M0AR	,DMA1_base+0x007C 
.equ absDMA1_S4M1AR	,DMA1_base+0x0080 
.equ absDMA1_S4FCR	,DMA1_base+0x0084 
.equ absDMA1_S5CR	,DMA1_base+0x0088 
.equ absDMA1_S5NDTR	,DMA1_base+0x008C 
.equ absDMA1_S5PAR	,DMA1_base+0x0090 
.equ absDMA1_S5M0AR	,DMA1_base+0x0094 
.equ absDMA1_S5M1AR	,DMA1_base+0x0098 
.equ absDMA1_S5FCR	,DMA1_base+0x009C 
.equ absDMA1_S6CR	,DMA1_base+0x00A0 
.equ absDMA1_S6NDTR	,DMA1_base+0x00A4 
.equ absDMA1_S6PAR	,DMA1_base+0x00A8 
.equ absDMA1_S6M0AR	,DMA1_base+0x00AC 
.equ absDMA1_S6M1AR	,DMA1_base+0x00B0 
.equ absDMA1_S6FCR	,DMA1_base+0x00B4 
.equ absDMA1_S7CR	,DMA1_base+0x00B8 
.equ absDMA1_S7NDTR	,DMA1_base+0x00BC 
.equ absDMA1_S7PAR	,DMA1_base+0x00C0 
.equ absDMA1_S7M0AR	,DMA1_base+0x00C4 
.equ absDMA1_S7M1AR	,DMA1_base+0x00C8 
.equ absDMA1_S7FCR	,DMA1_base+0x00CC 
@; DMA1 absolute register addresses
.equ absDMA2_LISR 	,DMA2_base+0x0000
.equ absDMA2_HISR	,DMA2_base+0x0004 
.equ absDMA2_LIFCR	,DMA2_base+0x0008 
.equ absDMA2_HIFCR	,DMA2_base+0x000C 
.equ absDMA2_S0CR	,DMA2_base+0x0010 
.equ absDMA2_S0NDTR	,DMA2_base+0x0014 
.equ absDMA2_S0PAR	,DMA2_base+0x0018 
.equ absDMA2_S0M0AR	,DMA2_base+0x001C 
.equ absDMA2_S0M1AR	,DMA2_base+0x0020 
.equ absDMA2_S0FCR	,DMA2_base+0x0024 
.equ absDMA2_S1CR	,DMA2_base+0x0028 
.equ absDMA2_S1NDTR	,DMA2_base+0x002C 
.equ absDMA2_S1PAR	,DMA2_base+0x0030 
.equ absDMA2_S1M0AR	,DMA2_base+0x0034 
.equ absDMA2_S1M1AR	,DMA2_base+0x0038 
.equ absDMA2_S1FCR	,DMA2_base+0x003C 
.equ absDMA2_S2CR	,DMA2_base+0x0040 
.equ absDMA2_S2NDTR	,DMA2_base+0x0044 
.equ absDMA2_S2PAR	,DMA2_base+0x0048 
.equ absDMA2_S2M0AR	,DMA2_base+0x004C 
.equ absDMA2_S2M1AR	,DMA2_base+0x0050 
.equ absDMA2_S2FCR	,DMA2_base+0x0054 
.equ absDMA2_S3CR	,DMA2_base+0x0058 
.equ absDMA2_S3NDTR	,DMA2_base+0x005C 
.equ absDMA2_S3PAR	,DMA2_base+0x0060 
.equ absDMA2_S3M0AR	,DMA2_base+0x0064 
.equ absDMA2_S3M1AR	,DMA2_base+0x0068 
.equ absDMA2_S3FCR	,DMA2_base+0x006C 
.equ absDMA2_S4CR	,DMA2_base+0x0070 
.equ absDMA2_S4NDTR	,DMA2_base+0x0074 
.equ absDMA2_S4PAR	,DMA2_base+0x0078 
.equ absDMA2_S4M0AR	,DMA2_base+0x007C 
.equ absDMA2_S4M1AR	,DMA2_base+0x0080 
.equ absDMA2_S4FCR	,DMA2_base+0x0084 
.equ absDMA2_S5CR	,DMA2_base+0x0088 
.equ absDMA2_S5NDTR	,DMA2_base+0x008C 
.equ absDMA2_S5PAR	,DMA2_base+0x0090 
.equ absDMA2_S5M0AR	,DMA2_base+0x0094 
.equ absDMA2_S5M1AR	,DMA2_base+0x0098 
.equ absDMA2_S5FCR	,DMA2_base+0x009C 
.equ absDMA2_S6CR	,DMA2_base+0x00A0 
.equ absDMA2_S6NDTR	,DMA2_base+0x00A4 
.equ absDMA2_S6PAR	,DMA2_base+0x00A8 
.equ absDMA2_S6M0AR	,DMA2_base+0x00AC 
.equ absDMA2_S6M1AR	,DMA2_base+0x00B0 
.equ absDMA2_S6FCR	,DMA2_base+0x00B4 
.equ absDMA2_S7CR	,DMA2_base+0x00B8 
.equ absDMA2_S7NDTR	,DMA2_base+0x00BC 
.equ absDMA2_S7PAR	,DMA2_base+0x00C0 
.equ absDMA2_S7M0AR	,DMA2_base+0x00C4 
.equ absDMA2_S7M1AR	,DMA2_base+0x00C8 
.equ absDMA2_S7FCR	,DMA2_base+0x00CC 
